//获取帖子内容
var http = require('http');
var $ = require('cheerio');
//对validator模块的介绍 https://github.com/chriso/validator.js
var validator = require('validator');
var async = require('async');

var addURLs = require('./../models/url.js');
var addContent = require('./../models/content.js');    //temp_content.js用作测试代替content.js
var data_clear_url = require('./data_clear_url.js');
var addKeywords = require('./../models/keywords.js');


exports.main = function(){
  main();
};

function main(){    //启动器
  addURLs.find(null, null,{sort:[['_id', -1]]}, function(err, docs){
    /*
    for (var i=0; i<=docs[0].url.length-1; i++){
      getContent(docs[0].url[i]);
    }*/
    if (err) {
       console.log('err: ' + err);
       crawler_url.main();
    }
    if (docs.length != 0) {
      var i = 0;
      var timer = setInterval(function(){
         console.log('--帖子--' + i);
         getContent(docs[0].url[i]);
         i++;
         if (i>docs[0].url.length-1){
            clearInterval(timer);
            data_clear_url.clearURLs();   //循环完成时，进入第4步骤
         }
      }, randomTime());
    }
    else {
       console.log('没有找到url');
       crawler_url.main();
    }
    
  });
}

function randomTime(){   //生成2～3秒间的随机秒数,每次调用使用不同随机间隔
  var xx = Math.random();
  xx = Math.floor(xx*3000) + 3000;
  console.log('wait: ' + xx + 'ms');
  return xx;
}

function getContent(url){  //获取帖子内容
   var re = /.com/gi;
   var the_path = url.split(re)[1];
   console.log(the_path);
   
   var options={
        host:'www.douban.com',  
        path:the_path,
        //method:'get',
        headers:{
            'Content-Type':'application/x-www-form-urlencoded',  
            'User-Agent':'Mozilla/5.0 (X11; Ubuntu; Linux i686; rv:18.0) Gecko/20100101 Firefox/18.0',
            //'User-Agent':'Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0',
            //'Referer':'http://www.douban.com/group/dbapi/',
            'Host':'www.douban.com',
            'Connection':'keep-alive',
            'Cache-Control':'max-age=0',
            //'Accept-Language':'zh-cn,zh;q=0.8,en-us;q=0.5,en;q=0.3',
            //'Accept-Encoding':'gzip, deflate',
            //'Accept':'text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8'
        }
   };
   http.get(options, function(res) {
     var size = 0;
     var chunks = [];
     res.on('data', function(chunk){
         size += chunk.length;
         chunks.push(chunk);
     });
     res.on('end', function(){
        //拼接buffer
        var data = Buffer.concat(chunks, size);
        var stringData = data.toString();
        
        //获取title/uptime/date/text/url
        var title = $('h1', stringData).text();
        title = validator.trim(title);
        var uptime = $('.color-green', stringData).text();
        
        var re = / /gi;
        var date = uptime.split(re)[0];
        
        var text = $('.topic-content', stringData).children('p').text();
        
        //生成初步json
        var newContent = new addContent({
           title: title,             //帖子标题
           uptime: uptime,           //发帖时间
           text: text,               //帖子正文
           url: url,                 //帖子地址
           date: date                //发帖日期（比如2014-09-08）
        });
        
        
        async.auto({
           step1: function(callback, result){   //获取帖子关键词
              //var keys = checkKeys(title);
              addKeywords.find(function(err, docs){
                 var keys = [];
                 for (var i=0; i<=docs.length-1; i++) {
                    var station = title.indexOf(docs[i].keyword); 
                    //如果匹配到，则返回关键词在字符串中的位置，没匹配到则返回-1
                    if (station >= 0) {
                       keys.push(docs[i].keyword);
                    }
                 }
      
                 if ( keys.length != 0 ){
                    callback(null, keys);
                 }else{
                    callback(null, null);
                 }
              });
           },
           step2: ['step1', function(callback, result){   //判断重复并储存帖子
              console.log(result.step1);
              var newContent = new addContent({
                title: title,             //帖子标题
                uptime: uptime,           //发帖时间
                text: text,               //帖子正文
                url: url,                 //帖子地址
                keys: result.step1,               //帖子关键词数组
                date: date                //发帖日期（比如2014-09-08）
              });
        
           //进行滤重
           var today = todayDate();     //获取今天的日期
           console.log('【今天日期】： ' + today);
           console.log('【发帖日期】： ' + newContent.date);
           if (newContent.date == today){      //判断发帖时间是否是今天，暂时放开爬取所有日期，扩充数据
              addContent.findOne({url: newContent.url}, function(err, doc){ //判断是否跟今天的帖子重复
              if (err){ console.log('err: ' + err); };
              if (doc){
                 console.log('有重复帖子');
              }
              else{
                 //判断是否两个小组同时发帖子
                 addContent.findOne({title: newContent.title}, function(err, doc){
                    if (err){ console.log('err: ' + err); };
                    if (doc){
                       console.log('有两个小组同时发帖子');
                    } else {
                       newContent.save(function(err, doc, num){
                          console.log('【saved】: ' + num);
                       });
                    }
                 });
              }
           });
           }
           }]
        }, function(err, result){
           console.log('async.auto get err');
        });
        /*
        //重构
        async.auto({
           //step1说明,过滤
           step1: function(callback, result){
              filter(newContent);
           },
           //step2说明,从标题中获取地点
           step2:['step1', function(callback, result){
              console.log(
           }],
           //step3说明，从标题or正文中获得价格
           step3:['step2', function(callback, result){
           
           }]    
        }, function(err, result){
           console.log('async.auto get err');
        });
        */
        
     });
   }).on('error', function(e) {
      console.log("Got error: " + e.message);
   });
}

//step1 过滤
function filter(newContent){
   var today = todayDate();     //获取今天的日期
   console.log('【今天日期】： ' + today);
   console.log('【发帖日期】： ' + newContent.date);
   if (newContent.date == today){      //判断发帖时间是否是今天，暂时放开爬取所有日期，扩充数据
      addContent.findOne({url: newContent.url}, function(err, doc){ //判断是否跟今天的帖子重复
         if (err){ console.log('err: ' + err); };
         if (doc){
            console.log('有重复帖子');
         }
         else{
            //判断是否两个小组同时发帖子（title重复）
            addContent.findOne({title: newContent.title}, function(err, doc){
               if (err){ console.log('err: ' + err); };
               if (doc){
                  console.log('有两个小组同时发帖子');
               } else {
                  //过关斩将后，将newContent发送给下一步
                  return callback(null, newContent);
               }
            });
         }
      });
   }
}


function todayDate(){    //获得今天日期
   var today = new Date();
   var year = today.getFullYear();
   var month, date;
   
   if ((today.getMonth()+1) <= 9){
      month = '0' + (today.getMonth() + 1);  
   }else{
      month = today.getMonth() + 1;
   }
   if (today.getDate() <= 9){
      date = '0' + today.getDate();  
   }else{
      date = today.getDate();
   }
      
   today = year + '-' + month + '-' + date;
   return today;
}

/*
async.auto标准结构
        //重构
        async.auto({
           //step1说明
           step1: function(callback, result){
              callback(null, somethingAsResult);
           },
           //step2说明
           step2:['step1', function(callback, result){
              result.step1;
           }],
           //step3说明
           step3:['step2', function(callback, result){
           
           }]    
        }, function(err, result){
           console.log('async.auto get err');
        });
*/

/*
function allKey(){
   var allKeys = [
'西站','黄庄','中关村','学院路','安宁庄','白石桥','北航','北京大学','北太平庄','北洼路','厂洼','车道沟','大钟寺','定慧寺','恩济里','二里庄','甘家口','公主坟','航天桥','花园桥','交通大学','蓟门桥','金沟河','军博','联想桥','马连洼','明光桥','牡丹园','清河','清华大学','人民大学','上地','世纪城','双榆树','四季青','苏州街','苏州桥','田村','万柳','万泉河','万寿路','万寿寺','魏公村','温泉','五彩城','五道口','六道口','五棵松','五路居','香山','肖家河','西八里庄','西北旺','西二旗','西三旗','西山','西苑','学院路','永定路','玉泉路','皂君庙','增光路','知春路','紫竹桥','安慧桥','安贞','奥运村','百子湾','八里庄','北沙滩','北苑','CBD','常营','朝青板块','朝外大街','朝阳公园','慈云寺','大山子','大屯','大望路','定福庄','东坝','东大桥','豆各庄','垡头','甘露园','高碑店','工体','广渠门','管庄','国贸','国展','和平街','红庙','花家地','欢乐谷','华威桥','惠新里','惠新西街','呼家楼','将台路','建外大街','健翔桥','京广桥','劲松','酒仙桥','来广营','柳芳','麦子店','媒体村','南磨房','南沙滩','潘家园','三里屯','三元桥','芍药居','胜古','十八里店','石佛营','十里堡','十里河','首都机场','双井','双桥','水碓子','四惠','松榆里','孙河','太阳宫','甜水园','团结湖','望京','小关','小红门','西坝河','燕莎','姚家园','亚运村','左家庄','安定门','北京站','北新桥','朝阳门','灯市口','东单','东四','东四十条','东直门','海运仓','和平里','建国门','交道口','景山','沙滩','王府井','雍和宫','百万庄','车公庄','德胜门','地安门','阜成门','复兴门','官园','鼓楼','金融街','积水潭','六铺炕','马甸','木樨地','南礼士路','三里河','什刹海','小西天','西便门','西单','新街口','西四','西直门','月坛','展览路','真武庙','崇文门','磁器口','东花市','法华寺','光明楼','广渠门','龙潭湖','前门','天坛','新世界','永定门','宣武','白广路','白纸坊','菜市口','长椿街','椿树街道','大观园','大栅栏','广安门','和平门','红莲','虎坊桥','马连道','南菜园','牛街','陶然亭','天宁寺','天桥','宣武门','珠市口','丰台','北大地','菜户营','草桥','长辛店','成寿寺','大红门','东高地','东铁匠营','方庄','丰台路','丰益桥','和义','花乡','角门','嘉园','看丹桥','科技园区','莲花池','刘家窑','六里桥','丽泽桥','卢沟桥','马家堡','木樨园','南苑','蒲黄榆','七里庄','青塔','世界公园','宋家庄','太平桥','五里店','西客站','西罗园','新发地','洋桥','右安门','岳各庄','云岗','玉泉营','赵公口','总部基地','左安门','八里桥','八通线','北关','次渠','东关','果园','九棵树','临河里','梨园','潞城','马驹桥','乔庄','通州北苑','土桥','武夷花园','漷县','西门','新华大街','永乐店','永顺','运河大街','玉桥','张家湾','中仓','石景山','八宝山','八大处','八角','广宁','古城','金顶街','老山','鲁谷','模式口','苹果园','五里坨','西山','衙门口','杨庄','永乐','玉泉路','房山','长阳','窦店','房山城关','韩村河','良乡','琉璃河','阎村','燕山','迎风','周口店','昌平','百善','北七家','城北','城南','东小口','回龙观','霍营','立水桥','龙泽','南口','南邵镇','沙河','天通苑','小汤山','阳坊'
   ];
      var Keys = [
    '半淞园路',
    '董家渡',
    '老西门',
    '南京东路',
    '南浦大桥',
    '南外滩',
    '蓬莱公园',
    '人民广场',
    '外滩',
    '十六铺',
    '西藏南路','斜桥','豫园','打浦桥','复兴公园','淮海公园','淮海中路','鲁班路','卢湾周边','瑞金二路','世博滨江','五里桥','新天地','中山南一路','北京西路','曹家渡','江宁路','静安寺','南京西路','上海电视台','西康路','新闸路','玉佛寺','漕宝路地铁口','漕河泾','长桥','枫林路','复兴中路','衡山路','华东理工','淮海西路','华泾','湖南路','康建','凌云路','龙华','日晖新村','上海交大','上海南站','上海师大','上海图书馆','上海植物园','田林','万体馆','襄阳公园','斜土路','徐家汇','肇嘉浜路','八佰伴','北蔡','碧云','曹路','昌里','川沙','东昌站地铁站','东方路地铁','东明路','高桥','高行','合庆','花木','金桥','金杨新村','联洋', '临港新城',
  '六里',
  '龙阳路地铁站',
  '陆家嘴',
  '梅园',
  '南码头',
  '三林',
  '上钢新村',
  '上南',
  '世博滨江',
  '世纪公园',
  '塘桥',
  '唐镇',
  '外高桥',
  '潍坊新村',
  '杨东',
  '洋泾',
  '御桥',
  '张江',
  '周家渡',
  '竹园商贸区',
  '北新泾',
  '程家桥',
  '地铁中山公园',
  '动物园',
  '古北',
  '虹桥路',
  '江苏路地铁',
  '上海影城',
  '天山路',
  '仙霞',
  '西郊公园',
  '新华路',
  '镇宁路',
  '周家桥',
  '北外滩',
  '大柏树',
  '海宁路',
  '和平公园',
  '虹口周边',
  '虹口足球场',
  '江湾',
  '凉城',
  '临平路',
  '鲁迅公园',
  '曲阳路',
  '四川北路',
  '四平路',
  '提篮桥',
  '周家嘴路',
  '鞍山',
  '长白新村',
  '长阳路',
  '东外滩',
  '黄兴',
  '江浦路',
  '控江路',
  '平凉路',
  '五角场',
  '新华医院',
  '新江湾城',
  '杨浦大桥',
  '杨浦公园',
  '杨浦周边',
  '运光',
  '复旦',
  '中原',
  '周家嘴路',
  '曹杨',
  '长风公园',
  '长寿路',
  '长征',
  '甘泉路',
  '光新',
  '华东师大',
  '建德花园',
  '金沙江路',
  '李子园',
  '轻纺市场',
  '桃浦',
  '万里城',
  '武宁路',
  '宜川路',
  '真光',
  '真如',
  '中远两湾城',
  '宝山路',
  '场中路',
  '大宁路',
  '共和新路',
  '和田地区',
  '老北站',
  '彭浦',
  '天目西路',
  '汶水路',
  '西藏北路',
  '新客站',
  '延长路',
  '闸北公园',
  '闸北周边',
  '芷江西路',
  '北桥区快',
  '漕宝路',
  '春申',
  '东兰新村',
  '凤溪',
  '古美罗阳',
  '航华',
  '虹梅路',
  '虹桥',
  '华漕',
  '江川路',
  '静安新城',
  '金虹桥',
  '纪王',
  '老闵行',
  '龙柏金汇',
  '马桥',
  '梅陇',
  '闵行周边',
  '南方商城',
  '浦江',
  '蔷薇新村',
  '七宝',
  '七莘路',
  '莘庄',
  '吴泾',
  '颛桥',
  '诸翟',
  '宝山周边',
  '大场',
  '大华路',
  '东城区',
  '高境',
  '共富新村',
  '共康',
  '顾村',
  '锦秋花园',
  '刘行',
  '罗店',
  '罗泾',
  '罗南',
  '上海大学',
  '水产路',
  '泗塘',
  '淞宝',
  '淞南',
  '通河西城',
  '通河新村',
  '杨行',
  '友谊路',
  '月浦',
  '张庙',
  '安亭',
  '曹王',
  '封浜',
  '丰庄',
  '黄渡',
  '华亭',
  '嘉定城区',
  '嘉定新城',
  '嘉定周边',
  '江桥新城',
  '金鹤新城',
  '菊园新区',
  '娄塘',
  '马陆',
  '南翔',
  '唐行',
  '外冈',
  '徐行',
  '真新',
  '朱桥',
  '白鹤',
  '华新镇',
  '金泽',
  '青浦北部',
  '青浦工业园区',
  '青浦新城',
  '青浦周边',
  '香花桥',
  '夏阳街道',
  '徐泾',
  '赵屯',
  '赵巷',
  '重固',
  '朱家角',
  '金汇',
  '南桥',
  '庄行',
  '奉城',
  '柘林',
  '海湾',
  '海湾旅游区',
  '奉贤周边',
  '西渡',
  '康桥',
  '周浦',
  '祝桥',
  '惠南',
  '新场',
  '航头',
  '泥城',
  '芦潮港',
  '南汇周边',
  '黄浦',
  '卢湾',
  '静安',
  '徐汇',
  '浦东',
  '长宁',
  '虹口',
  '杨浦',
  '普陀',
  '闸北',
  '闵行',
  '宝山',
  '嘉定',
  '青浦',
  '奉贤',
  '南汇',
  '崇明','金山','松江',
  '磁悬浮',
  '1号线',
  '2号线',
  '3号线',
  '4号线',
  '5号线',
  '6号线',
  '7号线',
  '8号线',
  '9号线',
  '10号线',
  '10号线支线',
  '11号线',
  '11号线支线',
  '12号线',
  '16号线',
   ];
   
      var Keys = [
    '广佛线',
  '1号线',
  '2号线',
  '3号线',
  '3号线机场线',
  '4号线',
  '5号线',
  '8号线',
  'APM线',
   '岑村',
  '长兴',
  '车陂',
  '程介村',
  '东莞庄',
  '东圃',
  '岗顶',
  '广州大道中',
  '华景路',
  '华景新城',
  '黄村',
  '黄埔大道西',
  '骏景路',
  '柯木塱',
  '猎德',
  '林和',
  '龙洞',
  '龙口东',
  '龙口西',
  '沙河',
  '上社',
  '沙太南',
  '石牌',
  '棠德南路',
  '棠东',
  '棠下',
  '天河北',
  '天河东路',
  '天河公园',
  '天河客运站',
  '天河南',
  '天河南二路',
  '天河南一路',
  '天河周边',
  '天平架',
  '体育西路',
  '体育中心',
  '五山',
  '冼村',
  '小新塘',
  '燕塘',
  '员村',
  '员村二横路',
  '员村四横路',
  '粤垦',
  '中山大道',
  '珠村',
  '珠吉',
  '珠江大道',
  '珠江新城',
  '宝岗',
  '宝业路',
  '滨江',
  '滨江东',
  '滨江西',
  '昌岗',
  '赤岗',
  '东晓',
  '东晓南',
  '革新路',
  '工业大道北',
  '工业大道南',
  '工业大道中',
  '广州大道南',
  '官洲',
  '海幢',
  '海珠周边',
  '洪德',
  '华洲',
  '江南大道南',
  '江南大道中',
  '江南西',
  '江南中',
  '江燕路',
  '客村',
  '沥滘',
  '南华西',
  '南石头',
  '南田路',
  '南洲',
  '琶洲',
  '前进路',
  '瑞宝',
  '上渡路',
  '沙园',
  '下渡路',
  '晓港',
  '新港',
  '新港东',
  '新港西',
  '怡乐路',
  '中大',
  '百灵路',
  '白云',
  '北京路',
  '大东',
  '大南路',
  '大沙头',
  '德政路',
  '东川',
  '东风东',
  '东风路',
  '东湖',
  '东华路',
  '东山口',
  '二沙岛',
  '共和路',
  '广卫',
  '海珠北路',
  '海珠广场',
  '洪桥',
  '华乐',
  '黄花岗',
  '环市东',
  '建设路',
  '解放北',
  '解放南',
  '流花',
  '六榕',
  '麓景路',
  '梅花村',
  '农讲所',
  '农林下路',
  '盘福路',
  '起义路',
  '水荫路',
  '淘金',
  '文明路',
  '五羊新城',
  '小北',
  '西门口',
  '杨箕村',
  '越秀南',
  '越秀周边',
  '中山路',
  '白云大道北',
  '白云大道南',
  '白云周边',
  '东平',
  '广花',
  '广园路',
  '广州大道北',
  '桂花岗',
  '黄边',
  '黄石',
  '黄庄',
  '嘉禾望岗',
  '江高镇',
  '机场路',
  '景泰',
  '京溪',
  '金沙洲',
  '九佛',
  '龙归',
  '罗冲围',
  '梅花园',
  '南湖',
  '人和',
  '三元里',
  '沙太北',
  '沙太中',
  '石井',
  '太和',
  '棠景',
  '天河北苑',
  '同德围',
  '同和',
  '伍仙桥',
  '西槎路',
  '新市',
  '永泰',
  '远景路',
  '增槎路',
  '钟落潭',
  '竹料',
  '白鹅潭',
  '彩虹',
  '陈家祠',
  '第一津街',
  '东风西',
  '多宝路',
  '芳村',
  '芳村大道西',
  '逢源路',
  '光复北路',
  '花地湾',
  '华林',
  '黄岐',
  '黄沙',
  '环市西',
  '惠福路',
  '窖口',
  '康王路',
  '坑口',
  '荔湾路',
  '荔湾周边',
  '龙津',
  '南岸路',
  '桥中',
  '人民路',
  '沙面',
  '西村',
  '西堤二马路',
  '西关',
  '西华路',
  '西门口',
  '盐步',
  '站前路',
  '中山八路',
  '周门',
  '大石',
  '大学城',
  '番禺周边',
  '富豪山庄',
  '华南',
  '华南碧桂园',
  '金山谷',
  '洛溪',
  '南村镇',
  '南浦',
  '桥南',
  '祈福',
  '沙湾',
  '石碁',
  '石楼',
  '市桥',
  '市桥北',
  '顺德碧桂园',
  '厦滘',
  '雅居乐',
  '亚运城',
  '钟村',
  '大沙地',
  '黄埔区府',
  '黄埔新村',
  '开发区东',
  '开发区西',
  '庙头',
  '石化路',
  '文冲',
  '下沙',
  '夏园',
  '渔珠',
  '旧区',
  '建设路',
  '狮岭',
  '山前大道',
  '新区',
  '镜湖大道',
  '铁路西',
  '东坑',
  '凤凰城',
  '港口大道',
  '广园东',
  '荔城',
  '荔新大道',
  '新塘',
  '新塘南',
  '永和',
  '开发西区',
  '开发东区',
  '萝岗',
  '保利香雪山',
  '开创大道北',
  '东城',
  '南城',
  '莞城',
  '虎门',
  '长安',
  '厚街',
  '南海',
  '禅城',
  '高明',
  '顺德',
  '三水',
  '塘厦',
  '清溪',
  '天河',
  '海珠',
  '越秀',
  '白云',
  '荔湾',
  '番禺',
  '黄埔',
  '花都',
  '增城',
  '萝岗',
  '东莞',
  '佛山',
  '南沙' 
   ];
   return allKeys;
}
*/


/*
暂时封印这些代码，分区域检索，以后还用的到

//查找关键词
function keyCheck(str){
   var keyWords = allWords;
   var keys = null;
   if (keys = checkcheck(keyWords['朝阳'], str)){
      return keys;
   }
   else if (keys = checkcheck(keyWords['海淀'], str)){
      return keys;
   }
   else if (keys = checkcheck(keyWords['东城'], str)){
      return keys;
   }
   else if (keys = checkcheck(keyWords['西城'], str)){
      return keys;
   }
   else if (keys = checkcheck(keyWords['崇文'], str)){
      return keys;
   }
   else if (keys = checkcheck(keyWords['宣武'], str)){
      return keys;
   }
   else if (keys = checkcheck(keyWords['昌平'], str)){
      return keys;
   }
   else if (keys = checkcheck(keyWords['丰台'], str)){
      return keys;
   }
   else if (keys = checkcheck(keyWords['通州'], str)){
      return keys;
   }
   else if (keys = checkcheck(keyWords['石景山'], str)){
      return keys;
   }
   else if (keys = checkcheck(keyWords['房山'], str)){
      return keys;
   }
   return null;
}

function checkcheck(keyWords, str){
   var keys = [];
   for (var i=0; i<=keyWords.length-1; i++){
      var station = str.indexOf(keyWords[i]); //如果匹配到，则返回关键词在字符串中的位置，没匹配到则返回-1
      if (station >= 0) {
        keys.push(keyWords[i]);
      }
   }
   if ( keys.length != 0 ){
     return keys;
   }else{
     return false;
   }
}

var allWords = {
    "海淀":[
      '海淀','中关村','学院路','安宁庄','白石桥','北航','北京大学','北太平庄','北洼路','厂洼','车道沟','大钟寺','定慧寺','恩济里','二里庄','甘家口','公主坟','航天桥','花园桥','交通大学','蓟门桥','金沟河','军博','联想桥','马连洼','明光桥','牡丹园','清河','清华大学','人民大学','上地','世纪城','双榆树','四季青','苏州街','苏州桥','田村','万柳','万泉河','万寿路','万寿寺','魏公村','温泉','五彩城','五道口','五棵松','五路居','香山','肖家河','西八里庄','西北旺','西二旗','西三旗','西山','西苑','学院路','永定路','玉泉路','皂君庙','增光路','知春路','紫竹桥'
    ],
    "朝阳":[
       '朝阳','安慧桥','安贞','奥运村','百子湾','八里庄','北沙滩','北苑','CBD','常营','朝青板块','朝外大街','朝阳公园','慈云寺','大山子','大屯','大望路','定福庄','东坝','东大桥','豆各庄','垡头','甘露园','高碑店','工体','广渠门','管庄','国贸','国展','和平街','红庙','花家地','欢乐谷','华威桥','惠新里','惠新西街','呼家楼','将台路','建外大街','健翔桥','京广桥','劲松','酒仙桥','来广营','柳芳','麦子店','媒体村','南磨房','南沙滩','潘家园','三里屯','三元桥','芍药居','胜古','十八里店','石佛营','十里堡','十里河','首都机场','双井','双桥','水碓子','四惠','松榆里','孙河','太阳宫','甜水园','团结湖','望京','小关','小红门','西坝河','燕莎','姚家园','亚运村','左家庄'
    ],
    "东城":[
      '东城','安定门','北京站','北新桥','朝阳门','灯市口','东单','东四','东四十条','东直门','海运仓','和平里','建国门','交道口','景山','沙滩','王府井','雍和宫'
    ],
    "西城":[
       '西城','百万庄','车公庄','德胜门','地安门','阜成门','复兴门','官园','鼓楼','金融街','积水潭','六铺炕','马甸','木樨地','南礼士路','三里河','什刹海','小西天','西便门','西单','新街口','西四','西直门','月坛','展览路','真武庙'
    ],
    "崇文":[
      '崇文门','磁器口','东花市','法华寺','光明楼','广渠门','龙潭湖','前门','天坛','新世界','永定门'
    ],
    "宣武":[
     '宣武','白广路','白纸坊','菜市口','长椿街','椿树街道','大观园','大栅栏','广安门','和平门','红莲','虎坊桥','马连道','南菜园','牛街','陶然亭','天宁寺','天桥','宣武门','珠市口'
    ],
    "丰台":[
     '丰台','北大地','菜户营','草桥','长辛店','成寿寺','大红门','东高地','东铁匠营','方庄','丰台路','丰益桥','和义','花乡','角门','嘉园','看丹桥','科技园区','莲花池','刘家窑','六里桥','丽泽桥','卢沟桥','马家堡','木樨园','南苑','蒲黄榆','七里庄','青塔','世界公园','宋家庄','太平桥','五里店','西客站','西罗园','新发地','洋桥','右安门','岳各庄','云岗','玉泉营','赵公口','总部基地','左安门'
    ],
    "通州":[
     '八里桥','八通线','北关','次渠','东关','果园','九棵树','临河里','梨园','潞城','马驹桥','乔庄','通州北苑','土桥','武夷花园','漷县','西门','新华大街','永乐店','永顺','运河大街','玉桥','张家湾','中仓' 
    ],
    "石景山":[
     '石景山','八宝山','八大处','八角','广宁','古城','金顶街','老山','鲁谷','模式口','苹果园','五里坨','西山','衙门口','杨庄','永乐','玉泉路' 
    ],
    "房山":[
     '房山','长阳','窦店','房山城关','韩村河','良乡','琉璃河','阎村','燕山','迎风','周口店' 
    ],
    "昌平":[
     '昌平','百善','北七家','城北','城南','东小口','回龙观','霍营','立水桥','龙泽','南口','南邵镇','沙河','天通苑','小汤山','阳坊' 
    ],
};

*/
